src/InformationRegisters/ЗначенияНастроекПрограммы/ЗначенияНастроекПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияНастроекПрограммы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПрограммы</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПрограммы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗначения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЭтаповЗадачиМетеор/ИсторияЭтаповЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЭтаповЗадачиМетеор</name>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>стрИсполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/РаботаСДаннымиМетеор/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Методы для получения и изменения данных, связанных с Метеор
//  
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция НомерЗадачиИзСтроки(ПроверяемаяСтрока) Экспорт

	НомерЗадачи = "";

	Для Итератор = 1 По СтрДлина(ПроверяемаяСтрока) Цикл
		Символ = Сред(ПроверяемаяСтрока, Итератор, 1);
		Если Символ = " " Или Символ = Символы.Таб Или Символ = Символы.ПС Тогда
			Прервать;
		КонецЕсли;
		НомерЗадачи = НомерЗадачи + Символ;
	КонецЦикла;
	Если СтрЗаканчиваетсяНа(НомерЗадачи, ".") Тогда
		НомерЗадачи = Лев(НомерЗадачи, СтрДлина(НомерЗадачи) - 1);
	КонецЕсли;
	Возврат НомерЗадачи;

КонецФункции

#КонецОбласти

#Область СлужебныеПрограммныйИнтерфейс

Процедура ЗагрузкаИсторииЭтаповЗадачМетеорОбработчикЗадания() Экспорт
	
	Настройка = ПланыВидовХарактеристик.НастройкиПрограммы.ОтметкаВремениЗагрузкиЭтаповМетеор;
	НачалоПериода = РегистрыСведений.ЗначенияНастроекПрограммы.ПолучитьЗначениеНастройки(Настройка);
	НачалоПериода = Макс(НачалоПериода, ТекущаяДатаСеанса() - 7 * 24 * 3600); // старые данные не актуальны
	НачалоПериода = Макс(НачалоПериода, '20231003'); // Дата с которой даты этапов стали совпадать
	
	КонецПериода = ТекущаяДатаСеанса();
	ЗагрузкаИсторииЭтаповЗадачМетеорЗаПериод(НачалоПериода, КонецПериода);
	РегистрыСведений.ЗначенияНастроекПрограммы.ЗаписатьЗначениеНастройки(Настройка, КонецПериода);
	
КонецПроцедуры

Функция ЗагрузкаИсторииЭтаповЗадачМетеорЗаПериод(НачалоПериода, КонецПериода) Экспорт
	
	ЭтапыМетеор = ИнтеграцияСМетеор.ИзмененияЭтаповЗадачМетеорЗаПериод(НачалоПериода, КонецПериода);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапыМетеор.Дата КАК Дата,
		|	ЭтапыМетеор.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ЭтапыМетеор.ЭтапМетеор КАК ЭтапМетеор,
		|	ЭтапыМетеор.Исполнитель КАК Исполнитель,
		|	ЭтапыМетеор.стрИсполнитель КАК стрИсполнитель
		|ПОМЕСТИТЬ ЭтапыМетеор
		|ИЗ
		|	&ЭтапыМетеор КАК ЭтапыМетеор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтапыМетеор.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ЭтапыМетеор.Дата КАК Дата,
		|	ЭтапыМетеор.ЭтапМетеор КАК Этап,
		|	ЭтапыМетеор.Исполнитель КАК Исполнитель,
		|	ЭтапыМетеор.стрИсполнитель КАК стрИсполнитель,
		|	NULL КАК Тип,
		|	""Дозагрузка"" КАК Комментарий
		|ИЗ
		|	ЭтапыМетеор КАК ЭтапыМетеор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияЭтаповЗадачиМетеор КАК ЭтапыРепос
		|		ПО ЭтапыМетеор.ЗадачаМетеор = ЭтапыРепос.ЗадачаМетеор
		|			И ЭтапыМетеор.Дата = ЭтапыРепос.Дата
		|			И ЭтапыМетеор.ЭтапМетеор = ЭтапыРепос.Этап
		|ГДЕ
		|	ЭтапыРепос.Этап ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ЗадачаМетеор";
	Запрос.УстановитьПараметр("ЭтапыМетеор", ЭтапыМетеор);
	
	НедостающиеСтатусы = Запрос.Выполнить().Выгрузить();
	Для Каждого НедостающийСтатус Из НедостающиеСтатусы Цикл
		РегистрыСведений.ИсторияЭтаповЗадачиМетеор.Отразить(
			НедостающийСтатус.ЗадачаМетеор, 
			НедостающийСтатус.Этап, 
			НедостающийСтатус.Исполнитель, 
			НедостающийСтатус.стрИсполнитель, 
			НедостающийСтатус.Тип, 
			НедостающийСтатус.Комментарий, 
			НедостающийСтатус.Дата
		);
	КонецЦикла;
	
	Возврат НедостающиеСтатусы.Количество();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
